Revit 2026 API

# HostObjectUtilsGetBottomFaces Method

---

Returns the bottom faces for this host object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<Reference> GetBottomFaces(
	HostObject hostObject
)
```
```vb
Public Shared Function GetBottomFaces (
	hostObject As HostObject
) As IList(Of Reference)
```
```cpp
public:
static IList<Reference^>^ GetBottomFaces(
	HostObject^ hostObject
)
```
```fsharp
static member GetBottomFaces :
        hostObject : HostObject -> IList<Reference>
```

#### Parameters

hostObject HostObject
     The host object.

#### Return Value

IListReference An array of references to the faces which are at the bottom of this element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This host object does not support access to top or bottom faces. |
| ArgumentNullException | A non-optional argument was null |

This utility supports host objects whose bottom faces represent one of the boundaries of CompoundStructure (such as roofs, floors or ceilings).

#### Reference

HostObjectUtils Class

Autodesk.Revit.DB Namespace